nummernHoeren/all.org
#+title: All

* Description
User will hear a number by clicking the button "Wiederholen".
They can then click one of the options below. Clicking a button will repeat the sound.
After their selection they can press "Überprüfen" to check whether they selected the correct option.

If the choice was correct the Überprüfen button will change color to green and it's text will change to "Richtig!". If the answer was wrong, the button will turn red and text "Versuch nochmal" will appear.

By loading the page again another number will be quizzed.

* Functionalities
** Repeat Button / New Number Button
** Choice buttons
** Check Answer button


* ISSUES
** TODO Check button disappers
Check button disappears when developer console is opened.
* IDEAS
** DONE Stylize buttons "Wiederholen" and "Überprüfen" to diffently from answer options
:PROPERTIES:
:CUSTOM_ID: Stylize-wiederholen-überprüfen-buttons
:END:
** Reduce number of answer options
Now "Wiederholen" button overlaps with some of the choice options.
** Generate random answer options
** Add option quiz specific set of numbers
** Add option to quiz specific range of numbers
** DONE Split js_file code block into separate blocks
Split related rows into their own blocks. Aim is to make it easier to refer to them and comment on them.
** Change vocabulary used to match Multiple choice terminology
Currently source code contains haphazardly used vocabulary/terminology. Maybe aim could be to talk about concepts using words in Wikipedia's [[https://en.wikipedia.org/wiki/Multiple_choice][multiple choice article]].
** TODO Provide a way to quiz another sound?
Currently a new sound is available only when page is reloaded. Provide a way to get a new question without reloading. For example a button to play another sound.

Maybe the "Wiederholen" button could be changed to ask if user wants another number question.
*** Wiederholen button
- HTML: [[*Repeat div][Repeat div]]
- JS: [[*Add eventListener to repeatBtn][Add eventListener to repeatBtn]]

*** Implementation
- Add class newNumber to button element in [[*Repeat div][Repeat div]]
- Add styling for class newNumber
- modify eventListener of repeatBtn: [[*Add eventListener to repeatBtn][eventListener of repeatBtn]]

** Design for both laptop/desktop and cellphone monitors
** DONE Remove the overlapping of buttons
Now answer option buttons are partially blocked by "Wiederholen" button and "Überprüfen" button is not visible unless user zooms out. This is on screen with resolution 1920x1080.
*** Background knowledge
Some components related to this:
- [[*Repeat div][Repeat div]]
- [[*Answer options][Answer options]]
- [[*Check div][Check div]]
** Add link pointing to the homepage.
** Add linking pointing to the source code

* Building the page

** Sound files
The sound files are downloaded from the [[https://de.wiktionary.org/wiki/zwei][German wiktionary]]. The first four numbers (zero to three) I've downloaded manually, but if I'm going to add tens of hundreds of numbers I'd like to do it programmatically.


