nummernHoeren/all.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-21 Fri 15:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>All</title>
<meta name="author" content="Reflektoin" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">All</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6eaf421">1. Description</a></li>
<li><a href="#org868478f">2. Functionalities</a>
<ul>
<li><a href="#org9b31d1c">2.1. Repeat Button / New Number Button</a></li>
<li><a href="#orgacde8d1">2.2. Choice buttons</a></li>
<li><a href="#orge04243d">2.3. Check Answer button</a></li>
</ul>
</li>
<li><a href="#org8fe0b6c">3. ISSUES</a>
<ul>
<li><a href="#org926c49d">3.1. <span class="todo TODO">TODO</span> Check button disappers</a></li>
</ul>
</li>
<li><a href="#orgabff953">4. IDEAS</a>
<ul>
<li><a href="#Stylize-wiederholen-überprüfen-buttons">4.1. <span class="done DONE">DONE</span> Stylize buttons &ldquo;Wiederholen&rdquo; and &ldquo;Überprüfen&rdquo; to diffently from answer options</a></li>
<li><a href="#org2cc5052">4.2. Reduce number of answer options</a></li>
<li><a href="#orgaccd3c3">4.3. Generate random answer options</a></li>
<li><a href="#org7f298f7">4.4. Add option quiz specific set of numbers</a></li>
<li><a href="#orgcc5cae0">4.5. Add option to quiz specific range of numbers</a></li>
<li><a href="#org4420f11">4.6. <span class="done DONE">DONE</span> Split js<sub>file</sub> code block into separate blocks</a></li>
<li><a href="#org53a1bc4">4.7. Change vocabulary used to match Multiple choice terminology</a></li>
<li><a href="#orgf919667">4.8. <span class="todo TODO">TODO</span> Provide a way to quiz another sound?</a>
<ul>
<li><a href="#org353cdcd">4.8.1. Wiederholen button</a></li>
<li><a href="#orgb75aa9b">4.8.2. Implementation</a></li>
</ul>
</li>
<li><a href="#orge00b412">4.9. Design for both laptop/desktop and cellphone monitors</a></li>
<li><a href="#org002cd61">4.10. <span class="done DONE">DONE</span> Remove the overlapping of buttons</a>
<ul>
<li><a href="#org89331cd">4.10.1. Background knowledge</a></li>
</ul>
</li>
<li><a href="#org73fab07">4.11. Add link pointing to the homepage.</a></li>
<li><a href="#org43374ee">4.12. Add linking pointing to the source code</a></li>
</ul>
</li>
<li><a href="#org3ea0991">5. Building the page</a>
<ul>
<li><a href="#org896215e">5.1. Sound files</a></li>
<li><a href="#org8780fa0">5.2. HTML file</a>
<ul>
<li><a href="#org209038c">5.2.1. Repeat div</a></li>
<li><a href="#orgeb221b1">5.2.2. Answer options</a></li>
<li><a href="#orgb571159">5.2.3. Check div</a></li>
<li><a href="#orgcf66699">5.2.4. Footer</a></li>
<li><a href="#org83dc3ed">5.2.5. Script element</a></li>
<li><a href="#org27d5804">5.2.6. End body and html elements</a></li>
</ul>
</li>
<li><a href="#orga06b429">5.3. CSS file</a></li>
<li><a href="#orgeffd70f">5.4. JavaScript file</a>
<ul>
<li><a href="#org2fadb37">5.4.1. AddSounds function definition and call</a></li>
<li><a href="#orgfea0411">5.4.2. Variable definitions</a></li>
<li><a href="#org825302b">5.4.3. Generate and add sound buttons</a></li>
<li><a href="#org2fd6176">5.4.4. Generate and add check button</a></li>
<li><a href="#org6ea42d4">5.4.5. stopSongs function definition</a></li>
<li><a href="#org20fa4f0">5.4.6. getRandomNumberSound</a></li>
<li><a href="#org7dc51a2">5.4.7. clearSelection definition</a></li>
<li><a href="#org9969c39">5.4.8. resetCheckBtn definition</a></li>
<li><a href="#orgafed98c">5.4.9. Add eventListener to repeatBtn</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6eaf421" class="outline-2">
<h2 id="org6eaf421"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
User will hear a number by clicking the button &ldquo;Wiederholen&rdquo;.
They can then click one of the options below. Clicking a button will repeat the sound.
After their selection they can press &ldquo;Überprüfen&rdquo; to check whether they selected the correct option.
</p>

<p>
If the choice was correct the Überprüfen button will change color to green and it&rsquo;s text will change to &ldquo;Richtig!&rdquo;. If the answer was wrong, the button will turn red and text &ldquo;Versuch nochmal&rdquo; will appear.
</p>

<p>
By loading the page again another number will be quizzed.
</p>
</div>
</div>

<div id="outline-container-org868478f" class="outline-2">
<h2 id="org868478f"><span class="section-number-2">2.</span> Functionalities</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9b31d1c" class="outline-3">
<h3 id="org9b31d1c"><span class="section-number-3">2.1.</span> Repeat Button / New Number Button</h3>
</div>
<div id="outline-container-orgacde8d1" class="outline-3">
<h3 id="orgacde8d1"><span class="section-number-3">2.2.</span> Choice buttons</h3>
</div>
<div id="outline-container-orge04243d" class="outline-3">
<h3 id="orge04243d"><span class="section-number-3">2.3.</span> Check Answer button</h3>
</div>
</div>


<div id="outline-container-org8fe0b6c" class="outline-2">
<h2 id="org8fe0b6c"><span class="section-number-2">3.</span> ISSUES</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org926c49d" class="outline-3">
<h3 id="org926c49d"><span class="section-number-3">3.1.</span> <span class="todo TODO">TODO</span> Check button disappers</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Check button disappears when developer console is opened.
</p>
</div>
</div>
</div>
<div id="outline-container-orgabff953" class="outline-2">
<h2 id="orgabff953"><span class="section-number-2">4.</span> IDEAS</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-Stylize-wiederholen-überprüfen-buttons" class="outline-3">
<h3 id="Stylize-wiederholen-überprüfen-buttons"><span class="section-number-3">4.1.</span> <span class="done DONE">DONE</span> Stylize buttons &ldquo;Wiederholen&rdquo; and &ldquo;Überprüfen&rdquo; to diffently from answer options</h3>
<div class="outline-text-3" id="text-Stylize-wiederholen-überprüfen-buttons">
</div>
</div>
<div id="outline-container-org2cc5052" class="outline-3">
<h3 id="org2cc5052"><span class="section-number-3">4.2.</span> Reduce number of answer options</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Now &ldquo;Wiederholen&rdquo; button overlaps with some of the choice options.
</p>
</div>
</div>
<div id="outline-container-orgaccd3c3" class="outline-3">
<h3 id="orgaccd3c3"><span class="section-number-3">4.3.</span> Generate random answer options</h3>
</div>
<div id="outline-container-org7f298f7" class="outline-3">
<h3 id="org7f298f7"><span class="section-number-3">4.4.</span> Add option quiz specific set of numbers</h3>
</div>
<div id="outline-container-orgcc5cae0" class="outline-3">
<h3 id="orgcc5cae0"><span class="section-number-3">4.5.</span> Add option to quiz specific range of numbers</h3>
</div>
<div id="outline-container-org4420f11" class="outline-3">
<h3 id="org4420f11"><span class="section-number-3">4.6.</span> <span class="done DONE">DONE</span> Split js<sub>file</sub> code block into separate blocks</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Split related rows into their own blocks. Aim is to make it easier to refer to them and comment on them.
</p>
</div>
</div>
<div id="outline-container-org53a1bc4" class="outline-3">
<h3 id="org53a1bc4"><span class="section-number-3">4.7.</span> Change vocabulary used to match Multiple choice terminology</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Currently source code contains haphazardly used vocabulary/terminology. Maybe aim could be to talk about concepts using words in Wikipedia&rsquo;s <a href="https://en.wikipedia.org/wiki/Multiple_choice">multiple choice article</a>.
</p>
</div>
</div>
<div id="outline-container-orgf919667" class="outline-3">
<h3 id="orgf919667"><span class="section-number-3">4.8.</span> <span class="todo TODO">TODO</span> Provide a way to quiz another sound?</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Currently a new sound is available only when page is reloaded. Provide a way to get a new question without reloading. For example a button to play another sound.
</p>

<p>
Maybe the &ldquo;Wiederholen&rdquo; button could be changed to ask if user wants another number question.
</p>
</div>
<div id="outline-container-org353cdcd" class="outline-4">
<h4 id="org353cdcd"><span class="section-number-4">4.8.1.</span> Wiederholen button</h4>
<div class="outline-text-4" id="text-4-8-1">
<ul class="org-ul">
<li>HTML: <a href="#org209038c">Repeat div</a></li>
<li>JS: <a href="#orgafed98c">Add eventListener to repeatBtn</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb75aa9b" class="outline-4">
<h4 id="orgb75aa9b"><span class="section-number-4">4.8.2.</span> Implementation</h4>
<div class="outline-text-4" id="text-4-8-2">
<ul class="org-ul">
<li>Add class newNumber to button element in <a href="#org209038c">Repeat div</a></li>
<li>Add styling for class newNumber</li>
<li>modify eventListener of repeatBtn: <a href="#orgafed98c">eventListener of repeatBtn</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge00b412" class="outline-3">
<h3 id="orge00b412"><span class="section-number-3">4.9.</span> Design for both laptop/desktop and cellphone monitors</h3>
</div>
<div id="outline-container-org002cd61" class="outline-3">
<h3 id="org002cd61"><span class="section-number-3">4.10.</span> <span class="done DONE">DONE</span> Remove the overlapping of buttons</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Now answer option buttons are partially blocked by &ldquo;Wiederholen&rdquo; button and &ldquo;Überprüfen&rdquo; button is not visible unless user zooms out. This is on screen with resolution 1920x1080.
</p>
</div>
<div id="outline-container-org89331cd" class="outline-4">
<h4 id="org89331cd"><span class="section-number-4">4.10.1.</span> Background knowledge</h4>
<div class="outline-text-4" id="text-4-10-1">
<p>
Some components related to this:
</p>
<ul class="org-ul">
<li><a href="#org209038c">Repeat div</a></li>
<li><a href="#orgeb221b1">Answer options</a></li>
<li><a href="#orgb571159">Check div</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org73fab07" class="outline-3">
<h3 id="org73fab07"><span class="section-number-3">4.11.</span> Add link pointing to the homepage.</h3>
</div>
<div id="outline-container-org43374ee" class="outline-3">
<h3 id="org43374ee"><span class="section-number-3">4.12.</span> Add linking pointing to the source code</h3>
</div>
</div>

<div id="outline-container-org3ea0991" class="outline-2">
<h2 id="org3ea0991"><span class="section-number-2">5.</span> Building the page</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org896215e" class="outline-3">
<h3 id="org896215e"><span class="section-number-3">5.1.</span> Sound files</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The sound files are downloaded from the <a href="https://de.wiktionary.org/wiki/zwei">German wiktionary</a>. The first four numbers (zero to three) I&rsquo;ve downloaded manually, but if I&rsquo;m going to add tens of hundreds of numbers I&rsquo;d like to do it programmatically.
</p>
</div>
</div>
