nummernHoeren/all.org
** HTML file
First we'll create an index.html file.

#+name: html_file
#+begin_src html :tangle index.html :comments link :noweb yes
<!DOCTYPE html>
<html lang="en">
#+end_src

#+name: head_element
#+begin_src html :tangle index.html :comments link
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="style.css">
    <title>Nummern hören</title>
</head>
#+end_src

#+name: begin_body
#+begin_src html :tangle index.html :comments link
<body>
#+end_src

*** Repeat div
The div with id 'repeat' acts as a container for the button with id 'repeatBtn'.
#+name: repeatDiv
#+begin_src html :tangle index.html :comments link
    <div id="repeat">
        <button id="repeatBtn" class="btn repeatBtn ">Wiederholen</button>
    </div>
#+end_src

*** Answer options
All possible answer options will be appended to the element below.
#+name: answer_options
#+begin_src html :tangle index.html :comments link
    <div id="buttons">

    </div>
#+end_src

*** Check div
Button for checking the answer will be added to this in script.js file.
#+name: check_answer
#+begin_src html :tangle index.html :comments link
    <div id="check">
    </div>
#+end_src

*** Footer
#+name: footer_element
#+begin_src html :tangle index.html :comments link
    <footer>License (CC BY-SA 3.0) for sounds: <a
            href="https://creativecommons.org/licenses/by-sa/3.0/deed.en">here</a><br>
        Source for sounds: <a href="https://de.wiktionary.org/wiki/Datei:De-eins.ogg">here</a>
    </footer>
#+end_src


*** Script element
Refer to the script.js file using [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script][script element]].
#+name: script_element
#+begin_src html :tangle index.html :comments link
    <script src="script.js"></script>
#+end_src

*** End body and html elements
#+name: end_body
#+begin_src html :tangle index.html :comments link
</body>
#+end_src

#+name: end_html
#+begin_src html :tangle index.html :comments link
</html>
#+end_src

Next we'll create a css file called style.css


