nummernHoeren/all.html


<div id="outline-container-org8780fa0" class="outline-3">
<h3 id="org8780fa0"><span class="section-number-3">5.2.</span> HTML file</h3>
<div class="outline-text-3" id="text-5-2">
<p>
First we&rsquo;ll create an index.html file.
</p>

<div class="org-src-container">
<pre class="src src-html" id="orgc447a66">&lt;<span style="color: #51afef;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #c678dd;">html</span> <span style="color: #dcaeea;">lang</span>=<span style="color: #98be65;">"en"</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html" id="org6b4fe14">&lt;<span style="color: #c678dd;">head</span>&gt;
    &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">charset</span>=<span style="color: #98be65;">"UTF-8"</span>&gt;
    &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">http-equiv</span>=<span style="color: #98be65;">"X-UA-Compatible"</span> <span style="color: #dcaeea;">content</span>=<span style="color: #98be65;">"IE=edge"</span>&gt;
    &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"viewport"</span> <span style="color: #dcaeea;">content</span>=<span style="color: #98be65;">"width=device-width, initial-scale=1.0"</span>&gt;
    &lt;<span style="color: #c678dd;">link</span> <span style="color: #dcaeea;">rel</span>=<span style="color: #98be65;">"stylesheet"</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"style.css"</span>&gt;
    &lt;<span style="color: #c678dd;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Nummern h&#246;ren</span>&lt;/<span style="color: #c678dd;">title</span>&gt;
&lt;/<span style="color: #c678dd;">head</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html" id="orgaded0fe">&lt;<span style="color: #c678dd;">body</span>&gt;
</pre>
</div>
</div>

<div id="outline-container-org209038c" class="outline-4">
<h4 id="org209038c"><span class="section-number-4">5.2.1.</span> Repeat div</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
The div with id &rsquo;repeat&rsquo; acts as a container for the button with id &rsquo;repeatBtn&rsquo;.
</p>
<div class="org-src-container">
<pre class="src src-html" id="orgbfc263d">    &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"repeat"</span>&gt;
        &lt;<span style="color: #c678dd;">button</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"repeatBtn"</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"btn repeatBtn "</span>&gt;Wiederholen&lt;/<span style="color: #c678dd;">button</span>&gt;
    &lt;/<span style="color: #c678dd;">div</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb221b1" class="outline-4">
<h4 id="orgeb221b1"><span class="section-number-4">5.2.2.</span> Answer options</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
All possible answer options will be appended to the element below.
</p>
<div class="org-src-container">
<pre class="src src-html" id="org302b379">    &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"buttons"</span>&gt;

    &lt;/<span style="color: #c678dd;">div</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb571159" class="outline-4">
<h4 id="orgb571159"><span class="section-number-4">5.2.3.</span> Check div</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
Button for checking the answer will be added to this in script.js file.
</p>
<div class="org-src-container">
<pre class="src src-html" id="orgc863359">    &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"check"</span>&gt;
    &lt;/<span style="color: #c678dd;">div</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf66699" class="outline-4">
<h4 id="orgcf66699"><span class="section-number-4">5.2.4.</span> Footer</h4>
<div class="outline-text-4" id="text-5-2-4">
<div class="org-src-container">
<pre class="src src-html" id="org27a592a">    &lt;<span style="color: #c678dd;">footer</span>&gt;License (CC BY-SA 3.0) for sounds: &lt;<span style="color: #c678dd;">a</span>
            <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"https://creativecommons.org/licenses/by-sa/3.0/deed.en"</span>&gt;here&lt;/<span style="color: #c678dd;">a</span>&gt;&lt;<span style="color: #c678dd;">br</span>&gt;
        Source for sounds: &lt;<span style="color: #c678dd;">a</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"https://de.wiktionary.org/wiki/Datei:De-eins.ogg"</span>&gt;here&lt;/<span style="color: #c678dd;">a</span>&gt;
    &lt;/<span style="color: #c678dd;">footer</span>&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-org83dc3ed" class="outline-4">
<h4 id="org83dc3ed"><span class="section-number-4">5.2.5.</span> Script element</h4>
<div class="outline-text-4" id="text-5-2-5">
<p>
Refer to the script.js file using <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script">script element</a>.
</p>
<div class="org-src-container">
<pre class="src src-html" id="org81fa0f4">    &lt;<span style="color: #c678dd;">script</span> <span style="color: #dcaeea;">src</span>=<span style="color: #98be65;">"script.js"</span>&gt;&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org27d5804" class="outline-4">
<h4 id="org27d5804"><span class="section-number-4">5.2.6.</span> End body and html elements</h4>
<div class="outline-text-4" id="text-5-2-6">
<div class="org-src-container">
<pre class="src src-html" id="orgb7defa1">&lt;/<span style="color: #c678dd;">body</span>&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html" id="orgf6ad66b">&lt;/<span style="color: #c678dd;">html</span>&gt;
</pre>
</div>

<p>
Next we&rsquo;ll create a css file called style.css
</p>
</div>
</div>
</div>
