nummernHoeren/all.org
** CSS file
#+name: css_file
#+begin_src css :tangle style.css :comments link
@import url('https://fonts.googleapis.com/css?family=Ubuntu');
#+end_src

#+name: global_styling
#+begin_src css :tangle style.css :comments link
,* {
    box-sizing: border-box;
}
#+end_src

#+name: body_styling
#+begin_src css :tangle style.css :comments link
body {
    background-color: rgb(161,100,223);
    font-family: 'Ubuntu', sans-serif;
    display: flex;
    flex-direction: column;
    flex-wrap: wrap;
    align-items: center;
    justify-content: center;
    text-align: center;
    margin: 0;
    overflow: hidden;
    height: 100vh;
}
#+end_src

#+name: footer_styling
#+begin_src css :tangle style.css :comments link
footer {
    position: absolute;
    bottom: 10px;
}
#+end_src


#+name: btn_class_styling
#+begin_src css :tangle style.css :comments link
.btn {
    background-color: rebeccapurple;
    border-radius: 5px;
    border: none;
    color: #fff;
    margin: 1rem;
    padding: 1.5rem 3rem;
    font-size: 1.2rem;
    font-family: inherit;
    cursor: pointer;
}
#+end_src

#+name: repeatBtn_styling
#+begin_src css :tangle style.css :comments link
.btn.repeatBtn{
    background-color: #444444;
    font-size: 2rem;

}

.newNumber {
    animation: reveal 0.5s ease-in;
}

@keyframes reveal {
    0% {
        transform: scale(0);
    }
    100% {
        transform: scale(1);
    }
}
#+end_src

https://developer.mozilla.org/en-US/docs/Web/CSS/:hover
#+name: btn_hover_styling
#+begin_src css :tangle style.css :comments link
.btn:hover {
    opacity: 0.9;
}
#+end_src

#+name: btn_focus_styling
#+begin_src css :tangle style.css :comments link
.btn:focus {
    outline: none;
}
#+end_src


https://developer.mozilla.org/en-US/docs/Web/CSS/:active
#+name: btn_active_styling
#+begin_src css :tangle style.css :comments link
.btn:active {
    scale: 0.95;
}
#+end_src

This defines how the user's selected option (the button which was clicked) is being stylized.
#+name: btn_selected_styling
#+begin_src css :tangle style.css :comments link
.btn.selected {
    opacity: 0.5;
}
#+end_src

#+name: repeat_id_styling
#+begin_src css :tangle style.css :comments link
#repeat {
    display: inline-block;
    top: 2.5%;
}
#+end_src

#+name: buttons-container_styling
#+begin_src css :tangle style.css :comments link
#buttons {
    display: inline-block;
    overflow-y: scroll;
    max-height: 500px;
}


#+end_src
#+name: btn_check_styling
#+begin_src css :tangle style.css :comments link
.btn.check {
    background-color: #1739dd;
    margin: 50px;
}
#+end_src

#+name: btn_check_wrong_styling
#+begin_src css :tangle style.css :comments link
.btn.check.wrong {
    background-color: red;
}
#+end_src

#+name: btn_correct_styling
#+begin_src css :tangle style.css :comments link
.btn.correct{
    background-color: green;
}
#+end_src


https://developer.mozilla.org/en-US/docs/Web/CSS/@media
#+name: small_screen styling
#+begin_src css :tangle style.css :comments link
@media(max-width: 500px){
    .btn {
        font-size: 0.8rem;
    }
}
#+end_src


** JavaScript file

#+name: sounds_def
#+begin_src javascript :tangle script.js :comments link
const sounds = [
  'null',
  'eins',
  'zwei',
  'drei',
  'fünf',
  'sechs',
  'sieben',
  'acht',
  'neun',
  'zehn',
  'elf',
  'zwölf',
  'dreizehn',
  'vierzehn',
  'fünfzehn',
  'sechzehn',
  'siebzehn',
  'achtzehn',
  'neunzehn',
  'zwanzig',
  'einundzwanzig',
  'zweiundzwanzig',
  'dreiundzwanzig',
  'vierundzwanzig',
  'fünfundzwanzig',
  'sechsundzwanzig',
  'siebenundzwanzig',
  'achtundzwanzig',
  'neunundzwanzig',
  'dreißig',
  'einunddreißig',
  'zweiunddreißig',
  'dreiunddreißig',
  'vierunddreißig',
  'fünfunddreißig',
  'sechsunddreißig',
  'siebenunddreißig',
  'achtunddreißig',
  'neununddreißig',
  'vierzig',
  'einundvierzig',
  'zweiundvierzig',
  'dreiundvierzig',
  'vierundvierzig',
  'fünfundvierzig',
  'sechsundvierzig',
  'siebenundvierzig',
  'achtundvierzig',
  'neunundvierzig',
  'fünfzig',
  'einundfünfzig',
  'zweiundfünfzig',
  'dreiundfünfzig',
  'vierundfünfzig',
  'fünfundfünfzig'
];
#+end_src

*** AddSounds function definition and call

#+name: addSounds
#+begin_src javascript :tangle script.js :comments link
addSounds()
function addSounds() {
  sounds.forEach((sound) => {
    const body = document.querySelector('body')
    const soundEl = document.createElement('audio')
    soundEl.id = sound
    soundEl.src = `sounds/De-${sound}.ogg`
    body.appendChild(soundEl)
  });
}
#+end_src

