nummernHoeren/all.html


<div id="outline-container-orga06b429" class="outline-3">
<h3 id="orga06b429"><span class="section-number-3">5.3.</span> CSS file</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-css" id="orgd865d27"><span style="color: #c678dd;">@import</span> url(<span style="color: #98be65;">'https://fonts.googleapis.com/css?family=Ubuntu'</span>);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="orgfd058f1"><span style="color: #51afef;">* </span>{
    <span style="color: #98be65;">box-sizing</span>: border-box;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="orgc61f912"><span style="color: #51afef;">body </span>{
    <span style="color: #98be65;">background-color</span>: <span style="color: #ffffff; background-color: #a164df;">rgb(161,100,223)</span>;
    <span style="color: #98be65;">font-family</span>: <span style="color: #98be65;">'Ubuntu'</span>, sans-serif;
    <span style="color: #98be65;">display</span>: flex;
    <span style="color: #98be65;">flex-direction</span>: column;
    <span style="color: #98be65;">flex-wrap</span>: wrap;
    <span style="color: #98be65;">align-items</span>: center;
    <span style="color: #98be65;">justify-content</span>: center;
    <span style="color: #98be65;">text-align</span>: center;
    <span style="color: #98be65;">margin</span>: <span style="color: #da8548; font-weight: bold;">0</span>;
    <span style="color: #98be65;">overflow</span>: hidden;
    <span style="color: #98be65;">height</span>: 100vh;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="org6ae1d28"><span style="color: #51afef;">footer </span>{
    <span style="color: #98be65;">position</span>: absolute;
    <span style="color: #98be65;">bottom</span>: 10px;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-css" id="org0fd83ce"><span style="color: #51afef;">.btn </span>{
    <span style="color: #98be65;">background-color</span>: <span style="color: #ffffff; background-color: #663399;">rebeccapurple</span>;
    <span style="color: #98be65;">border-radius</span>: 5px;
    <span style="color: #98be65;">border</span>: none;
    <span style="color: #98be65;">color</span>: <span style="color: #000000; background-color: #fff;">#fff</span>;
    <span style="color: #98be65;">margin</span>: 1rem;
    <span style="color: #98be65;">padding</span>: 1.5rem 3rem;
    <span style="color: #98be65;">font-size</span>: 1.2rem;
    <span style="color: #98be65;">font-family</span>: inherit;
    <span style="color: #98be65;">cursor</span>: pointer;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="orgf9e14b0"><span style="color: #51afef;">.btn.repeatBtn</span>{
    <span style="color: #98be65;">background-color</span>: <span style="color: #ffffff; background-color: #444444;">#444444</span>;
    <span style="color: #98be65;">font-size</span>: 2rem;

}

<span style="color: #51afef;">.newNumber </span>{
    <span style="color: #98be65;">animation</span>: reveal 0.5s ease-in;
}

<span style="color: #c678dd;">@keyframes</span> reveal {
    <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #51afef;">% </span>{
        <span style="color: #98be65;">transform</span>: scale(<span style="color: #da8548; font-weight: bold;">0</span>);
    }
    <span style="color: #da8548; font-weight: bold;">100</span><span style="color: #51afef;">% </span>{
        <span style="color: #98be65;">transform</span>: scale(<span style="color: #da8548; font-weight: bold;">1</span>);
    }
}
</pre>
</div>

<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:hover">https://developer.mozilla.org/en-US/docs/Web/CSS/:hover</a>
</p>
<div class="org-src-container">
<pre class="src src-css" id="orgbee03cd"><span style="color: #51afef;">.btn:hover </span>{
    <span style="color: #98be65;">opacity</span>: <span style="color: #da8548; font-weight: bold;">0.9</span>;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="org4479d75"><span style="color: #51afef;">.btn:focus </span>{
    <span style="color: #98be65;">outline</span>: none;
}
</pre>
</div>


<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/:active">https://developer.mozilla.org/en-US/docs/Web/CSS/:active</a>
</p>
<div class="org-src-container">
<pre class="src src-css" id="org9b800cd"><span style="color: #51afef;">.btn:active </span>{
    <span style="color: #98be65;">scale</span>: <span style="color: #da8548; font-weight: bold;">0.95</span>;
}
</pre>
</div>

<p>
This defines how the user&rsquo;s selected option (the button which was clicked) is being stylized.
</p>
<div class="org-src-container">
<pre class="src src-css" id="orgd6a58cb"><span style="color: #51afef;">.btn.selected </span>{
    <span style="color: #98be65;">opacity</span>: <span style="color: #da8548; font-weight: bold;">0.5</span>;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="orgee523cd"><span style="color: #51afef;">#repeat </span>{
    <span style="color: #98be65;">display</span>: inline-block;
    <span style="color: #98be65;">top</span>: <span style="color: #da8548; font-weight: bold;">2.5</span>%;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="org7ace484"><span style="color: #51afef;">#buttons </span>{
    <span style="color: #98be65;">display</span>: inline-block;
    <span style="color: #98be65;">overflow-y</span>: scroll;
    <span style="color: #98be65;">max-height</span>: 500px;
}


</pre>
</div>
<div class="org-src-container">
<pre class="src src-css" id="orgeed69d0"><span style="color: #51afef;">.btn.check </span>{
    <span style="color: #98be65;">background-color</span>: <span style="color: #ffffff; background-color: #1739dd;">#1739dd</span>;
    <span style="color: #98be65;">margin</span>: 50px;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="orgcba8a4f"><span style="color: #51afef;">.btn.check.wrong </span>{
    <span style="color: #98be65;">background-color</span>: <span style="color: #ffffff; background-color: #ff0000;">red</span>;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-css" id="orgb21bd0b"><span style="color: #51afef;">.btn.correct</span>{
    <span style="color: #98be65;">background-color</span>: <span style="color: #ffffff; background-color: #008000;">green</span>;
}
</pre>
</div>


<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/@media">https://developer.mozilla.org/en-US/docs/Web/CSS/@media</a>
</p>
<div class="org-src-container">
<pre class="src src-css" id="orga17099a"><span style="color: #c678dd;">@media</span>(max-width: 500px){
    <span style="color: #51afef;">.btn </span>{
        <span style="color: #98be65;">font-size</span>: 0.8rem;
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgeffd70f" class="outline-3">
<h3 id="orgeffd70f"><span class="section-number-3">5.4.</span> JavaScript file</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-javascript" id="org7540ecb"><span style="color: #51afef;">const</span> <span style="color: #dcaeea;">sounds</span> = [
  <span style="color: #98be65;">'null'</span>,
  <span style="color: #98be65;">'eins'</span>,
  <span style="color: #98be65;">'zwei'</span>,
  <span style="color: #98be65;">'drei'</span>,
  <span style="color: #98be65;">'f&#252;nf'</span>,
  <span style="color: #98be65;">'sechs'</span>,
  <span style="color: #98be65;">'sieben'</span>,
  <span style="color: #98be65;">'acht'</span>,
  <span style="color: #98be65;">'neun'</span>,
  <span style="color: #98be65;">'zehn'</span>,
  <span style="color: #98be65;">'elf'</span>,
  <span style="color: #98be65;">'zw&#246;lf'</span>,
  <span style="color: #98be65;">'dreizehn'</span>,
  <span style="color: #98be65;">'vierzehn'</span>,
  <span style="color: #98be65;">'f&#252;nfzehn'</span>,
  <span style="color: #98be65;">'sechzehn'</span>,
  <span style="color: #98be65;">'siebzehn'</span>,
  <span style="color: #98be65;">'achtzehn'</span>,
  <span style="color: #98be65;">'neunzehn'</span>,
  <span style="color: #98be65;">'zwanzig'</span>,
  <span style="color: #98be65;">'einundzwanzig'</span>,
  <span style="color: #98be65;">'zweiundzwanzig'</span>,
  <span style="color: #98be65;">'dreiundzwanzig'</span>,
  <span style="color: #98be65;">'vierundzwanzig'</span>,
  <span style="color: #98be65;">'f&#252;nfundzwanzig'</span>,
  <span style="color: #98be65;">'sechsundzwanzig'</span>,
  <span style="color: #98be65;">'siebenundzwanzig'</span>,
  <span style="color: #98be65;">'achtundzwanzig'</span>,
  <span style="color: #98be65;">'neunundzwanzig'</span>,
  <span style="color: #98be65;">'drei&#223;ig'</span>,
  <span style="color: #98be65;">'einunddrei&#223;ig'</span>,
  <span style="color: #98be65;">'zweiunddrei&#223;ig'</span>,
  <span style="color: #98be65;">'dreiunddrei&#223;ig'</span>,
  <span style="color: #98be65;">'vierunddrei&#223;ig'</span>,
  <span style="color: #98be65;">'f&#252;nfunddrei&#223;ig'</span>,
  <span style="color: #98be65;">'sechsunddrei&#223;ig'</span>,
  <span style="color: #98be65;">'siebenunddrei&#223;ig'</span>,
  <span style="color: #98be65;">'achtunddrei&#223;ig'</span>,
  <span style="color: #98be65;">'neununddrei&#223;ig'</span>,
  <span style="color: #98be65;">'vierzig'</span>,
  <span style="color: #98be65;">'einundvierzig'</span>,
  <span style="color: #98be65;">'zweiundvierzig'</span>,
  <span style="color: #98be65;">'dreiundvierzig'</span>,
  <span style="color: #98be65;">'vierundvierzig'</span>,
  <span style="color: #98be65;">'f&#252;nfundvierzig'</span>,
  <span style="color: #98be65;">'sechsundvierzig'</span>,
  <span style="color: #98be65;">'siebenundvierzig'</span>,
  <span style="color: #98be65;">'achtundvierzig'</span>,
  <span style="color: #98be65;">'neunundvierzig'</span>,
  <span style="color: #98be65;">'f&#252;nfzig'</span>,
  <span style="color: #98be65;">'einundf&#252;nfzig'</span>,
  <span style="color: #98be65;">'zweiundf&#252;nfzig'</span>,
  <span style="color: #98be65;">'dreiundf&#252;nfzig'</span>,
  <span style="color: #98be65;">'vierundf&#252;nfzig'</span>,
  <span style="color: #98be65;">'f&#252;nfundf&#252;nfzig'</span>
];
</pre>
</div>
</div>

<div id="outline-container-org2fadb37" class="outline-4">
<h4 id="org2fadb37"><span class="section-number-4">5.4.1.</span> AddSounds function definition and call</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">
<pre class="src src-javascript" id="org060cb62">addSounds()
<span style="color: #51afef;">function</span> <span style="color: #c678dd;">addSounds</span>() {
  sounds.forEach((sound) =&gt; {
    <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">body</span> = document.querySelector(<span style="color: #98be65;">'body'</span>)
    <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">soundEl</span> = document.createElement(<span style="color: #98be65;">'audio'</span>)
    soundEl.id = sound
    soundEl.src = <span style="color: #98be65;">`sounds/De-${sound}.ogg`</span>
    body.appendChild(soundEl)
  });
}
</pre>
</div>
</div>
</div>
