nummernHoeren/all.org
*** Variable definitions

#+name: variable_definitions
#+begin_src javascript :tangle script.js :comments link
let guessedAnswer = ''
let correctNumber = getRandomNumberSound()
const repeatBtn = document.querySelector('.btn.repeatBtn')
const checkEl = document.getElementById('check')
const checkBtn = document.createElement('button')
#+end_src


*** Generate and add sound buttons
#+name: js-sound-buttons
#+begin_src javascript :tangle script.js :comments link
sounds.forEach(sound => {
  const btn = document.createElement('button')
  btn.classList.add('btn');
  btn.classList.add('options');

  btn.innerText = sound;

  btn.addEventListener('click', () => {
    resetCheckBtn()
    clearSelection()
    stopSongs();
    document.getElementById(sound).play()
    guessedAnswer = sound

    //add indicator for selected answer
    btn.classList.add('selected')
  })

  document.getElementById('buttons').
    appendChild(btn);
})
#+end_src

*** Generate and add check button

#+name: js_checkBtn
#+begin_src javascript :tangle script.js :comments link
checkBtn.innerText = 'Überpfüfen'
checkBtn.classList.add('btn');
checkBtn.classList.add('check')
checkBtn.addEventListener('click', () => {
  //remove correct and wrong classes in case user had already guessed
  checkBtn.classList.remove('correct')
  checkBtn.classList.remove('right')
  let correctAnswer = sounds[correctNumber]
  if (guessedAnswer === correctAnswer) {
    console.log('Correct answer')

    //add class "correct" in order to stylize it to show that the answer was correct
    checkBtn.classList.add('correct')
    checkBtn.innerText = 'Richtig!'

    //modify wiederholen button to ask if user wants to be asked another number
    repeatBtn.innerText = 'Neu Nummer?'
    correctNumber = getRandomNumberSound()

    repeatBtn.classList.add('newNumber')
  } else {
    console.log('Wrong answer')
    checkBtn.classList.add('wrong')
    checkBtn.innerText = 'Versuch nochmal'
  }
})
checkEl.appendChild(checkBtn)
#+end_src


*** stopSongs function definition
This is used to stop playing sounds.
Scenario: User tries to play another sound while previous one is still playing. The program then stops the first sound so that only one sound will be played at a time.

Used in:
- [[*Generate and add sound buttons][Generate and add sound buttons]]

#+name: js_stopSongs_def
#+begin_src javascript :tangle script.js :comments link
function stopSongs() {
  sounds.forEach(sound => {
    const song = document.getElementById(sound)
    song.pause();
    song.currentTime = 0;
  })
}
#+end_src


*** getRandomNumberSound

#+name: js_getRandomNumberSound_def
#+begin_src javascript :tangle script.js :comments link
function getRandomNumberSound() {
  return Math.floor(Math.random() * sounds.length)
}
#+end_src


*** clearSelection definition
This is called to remove selection styling from other buttons when user clicks on an answer option.

#+name: js_clearSelection_def
#+begin_src javascript :tangle script.js :comments link
function clearSelection() {
  btns = document.querySelectorAll('.options')
  console.log('clear selection')
  btns.forEach((btn) => {
    btn.classList.remove('selected')
  })
}
#+end_src

*** resetCheckBtn definition
This is called when user clicks on an answer choice. They might have already checked whether their answer was correct and the buttons state would have changed. This returns button to it's starting state.
#+name: js_resetCheckBtn_def
#+begin_src javascript :tangle script.js :comments link
function resetCheckBtn() {
  const checkBtn = document.querySelector('#check button')
  checkBtn.innerText = 'Überpfüfen'
  checkBtn.classList.remove('wrong')
  checkBtn.classList.remove('correct')
}
#+end_src

*** Add eventListener to repeatBtn

#+name: js-repeatBtnEventListener
#+begin_src javascript :tangle script.js :comments link
repeatBtn.addEventListener('click', () => {
  if(repeatBtn.classList.contains('newNumber')){
    document.getElementById(sounds[correctNumber]).play()
    resetCheckBtn()
    clearSelection()
    repeatBtn.innerText = 'Wiederholen'
    repeatBtn.classList.remove('newNumber')
  }else {
  document.getElementById(sounds[correctNumber]).play()
  }
})
#+end_src
