nummernHoeren/all.html

<div id="outline-container-orgfea0411" class="outline-4">
<h4 id="orgfea0411"><span class="section-number-4">5.4.2.</span> Variable definitions</h4>
<div class="outline-text-4" id="text-5-4-2">
<div class="org-src-container">
<pre class="src src-javascript" id="org8a76d66"><span style="color: #51afef;">let</span> <span style="color: #dcaeea;">guessedAnswer</span> = <span style="color: #98be65;">''</span>
<span style="color: #51afef;">let</span> <span style="color: #dcaeea;">correctNumber</span> = getRandomNumberSound()
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">repeatBtn</span> = document.querySelector(<span style="color: #98be65;">'.btn.repeatBtn'</span>)
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">checkEl</span> = document.getElementById(<span style="color: #98be65;">'check'</span>)
<span style="color: #51afef;">const</span> <span style="color: #dcaeea;">checkBtn</span> = document.createElement(<span style="color: #98be65;">'button'</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-org825302b" class="outline-4">
<h4 id="org825302b"><span class="section-number-4">5.4.3.</span> Generate and add sound buttons</h4>
<div class="outline-text-4" id="text-5-4-3">
<div class="org-src-container">
<pre class="src src-javascript" id="org138f8b6">sounds.forEach(sound =&gt; {
  <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">btn</span> = document.createElement(<span style="color: #98be65;">'button'</span>)
  btn.classList.add(<span style="color: #98be65;">'btn'</span>);
  btn.classList.add(<span style="color: #98be65;">'options'</span>);

  btn.innerText = sound;

  btn.addEventListener(<span style="color: #98be65;">'click'</span>, () =&gt; {
    resetCheckBtn()
    clearSelection()
    stopSongs();
    document.getElementById(sound).play()
    guessedAnswer = sound

    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">add indicator for selected answer</span>
    btn.classList.add(<span style="color: #98be65;">'selected'</span>)
  })

  document.getElementById(<span style="color: #98be65;">'buttons'</span>).
    appendChild(btn);
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fd6176" class="outline-4">
<h4 id="org2fd6176"><span class="section-number-4">5.4.4.</span> Generate and add check button</h4>
<div class="outline-text-4" id="text-5-4-4">
<div class="org-src-container">
<pre class="src src-javascript" id="orge9f1390">checkBtn.innerText = <span style="color: #98be65;">'&#220;berpf&#252;fen'</span>
checkBtn.classList.add(<span style="color: #98be65;">'btn'</span>);
checkBtn.classList.add(<span style="color: #98be65;">'check'</span>)
checkBtn.addEventListener(<span style="color: #98be65;">'click'</span>, () =&gt; {
  <span style="color: #5B6268;">//</span><span style="color: #5B6268;">remove correct and wrong classes in case user had already guessed</span>
  checkBtn.classList.remove(<span style="color: #98be65;">'correct'</span>)
  checkBtn.classList.remove(<span style="color: #98be65;">'right'</span>)
  <span style="color: #51afef;">let</span> <span style="color: #dcaeea;">correctAnswer</span> = sounds[correctNumber]
  <span style="color: #51afef;">if</span> (guessedAnswer === correctAnswer) {
    console.log(<span style="color: #98be65;">'Correct answer'</span>)

    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">add class "correct" in order to stylize it to show that the answer was correct</span>
    checkBtn.classList.add(<span style="color: #98be65;">'correct'</span>)
    checkBtn.innerText = <span style="color: #98be65;">'Richtig!'</span>

    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">modify wiederholen button to ask if user wants to be asked another number</span>
    repeatBtn.innerText = <span style="color: #98be65;">'Neu Nummer?'</span>
    correctNumber = getRandomNumberSound()

    repeatBtn.classList.add(<span style="color: #98be65;">'newNumber'</span>)
  } <span style="color: #51afef;">else</span> {
    console.log(<span style="color: #98be65;">'Wrong answer'</span>)
    checkBtn.classList.add(<span style="color: #98be65;">'wrong'</span>)
    checkBtn.innerText = <span style="color: #98be65;">'Versuch nochmal'</span>
  }
})
checkEl.appendChild(checkBtn)
</pre>
</div>
</div>
</div>


<div id="outline-container-org6ea42d4" class="outline-4">
<h4 id="org6ea42d4"><span class="section-number-4">5.4.5.</span> stopSongs function definition</h4>
<div class="outline-text-4" id="text-5-4-5">
<p>
This is used to stop playing sounds.
Scenario: User tries to play another sound while previous one is still playing. The program then stops the first sound so that only one sound will be played at a time.
</p>

<p>
Used in:
</p>
<ul class="org-ul">
<li><a href="#org825302b">Generate and add sound buttons</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript" id="orgfbb7190"><span style="color: #51afef;">function</span> <span style="color: #c678dd;">stopSongs</span>() {
  sounds.forEach(sound =&gt; {
    <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">song</span> = document.getElementById(sound)
    song.pause();
    song.currentTime = <span style="color: #da8548; font-weight: bold;">0</span>;
  })
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org20fa4f0" class="outline-4">
<h4 id="org20fa4f0"><span class="section-number-4">5.4.6.</span> getRandomNumberSound</h4>
<div class="outline-text-4" id="text-5-4-6">
<div class="org-src-container">
<pre class="src src-javascript" id="orgcf67c2d"><span style="color: #51afef;">function</span> <span style="color: #c678dd;">getRandomNumberSound</span>() {
  <span style="color: #51afef;">return</span> Math.floor(Math.random() * sounds.length)
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org7dc51a2" class="outline-4">
<h4 id="org7dc51a2"><span class="section-number-4">5.4.7.</span> clearSelection definition</h4>
<div class="outline-text-4" id="text-5-4-7">
<p>
This is called to remove selection styling from other buttons when user clicks on an answer option.
</p>

<div class="org-src-container">
<pre class="src src-javascript" id="org08f2e1e"><span style="color: #51afef;">function</span> <span style="color: #c678dd;">clearSelection</span>() {
  btns = document.querySelectorAll(<span style="color: #98be65;">'.options'</span>)
  console.log(<span style="color: #98be65;">'clear selection'</span>)
  btns.forEach((btn) =&gt; {
    btn.classList.remove(<span style="color: #98be65;">'selected'</span>)
  })
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9969c39" class="outline-4">
<h4 id="org9969c39"><span class="section-number-4">5.4.8.</span> resetCheckBtn definition</h4>
<div class="outline-text-4" id="text-5-4-8">
<p>
This is called when user clicks on an answer choice. They might have already checked whether their answer was correct and the buttons state would have changed. This returns button to it&rsquo;s starting state.
</p>
<div class="org-src-container">
<pre class="src src-javascript" id="org7430f26"><span style="color: #51afef;">function</span> <span style="color: #c678dd;">resetCheckBtn</span>() {
  <span style="color: #51afef;">const</span> <span style="color: #dcaeea;">checkBtn</span> = document.querySelector(<span style="color: #98be65;">'#check button'</span>)
  checkBtn.innerText = <span style="color: #98be65;">'&#220;berpf&#252;fen'</span>
  checkBtn.classList.remove(<span style="color: #98be65;">'wrong'</span>)
  checkBtn.classList.remove(<span style="color: #98be65;">'correct'</span>)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafed98c" class="outline-4">
<h4 id="orgafed98c"><span class="section-number-4">5.4.9.</span> Add eventListener to repeatBtn</h4>
<div class="outline-text-4" id="text-5-4-9">
<div class="org-src-container">
<pre class="src src-javascript" id="org22f7d02">repeatBtn.addEventListener(<span style="color: #98be65;">'click'</span>, () =&gt; {
  <span style="color: #51afef;">if</span>(repeatBtn.classList.contains(<span style="color: #98be65;">'newNumber'</span>)){
    document.getElementById(sounds[correctNumber]).play()
    resetCheckBtn()
    clearSelection()
    repeatBtn.innerText = <span style="color: #98be65;">'Wiederholen'</span>
    repeatBtn.classList.remove(<span style="color: #98be65;">'newNumber'</span>)
  }<span style="color: #51afef;">else</span> {
  document.getElementById(sounds[correctNumber]).play()
  }
})
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Reflektoin</p>
<p class="date">Created: 2023-04-21 Fri 15:58</p>
</div>
</body>
</html>